wrk2/dome-no-cache/300KB/wrk-eth3-rep07.log
Running 30s test @ https://bench-eth2.netdev-lab.org/300k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 443.635ms, rate sampling interval: 2056ms
  Thread calibration: mean lat.: 419.357ms, rate sampling interval: 1815ms
  Thread calibration: mean lat.: 374.136ms, rate sampling interval: 1653ms
  Thread calibration: mean lat.: 468.722ms, rate sampling interval: 2209ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   336.40ms  415.59ms   6.61s    93.42%
    Req/Sec    61.87      5.20    76.00     84.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  225.02ms
 75.000%  350.72ms
 90.000%  611.33ms
 99.000%    1.92s 
 99.900%    5.32s 
 99.990%    6.62s 
 99.999%    6.62s 
100.000%    6.62s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      11.391     0.000000            1         1.00
     108.735     0.100000          499         1.11
     149.759     0.200000          997         1.25
     174.719     0.300000         1495         1.43
     198.655     0.400000         1994         1.67
     225.023     0.500000         2495         2.00
     242.943     0.550000         2741         2.22
     264.959     0.600000         2990         2.50
     291.839     0.650000         3239         2.86
     319.999     0.700000         3492         3.33
     350.719     0.750000         3739         4.00
     370.687     0.775000         3862         4.44
     406.527     0.800000         3987         5.00
     456.703     0.825000         4112         5.71
     495.615     0.850000         4237         6.67
     542.719     0.875000         4362         8.00
     570.879     0.887500         4423         8.89
     611.327     0.900000         4485        10.00
     655.359     0.912500         4547        11.43
     711.679     0.925000         4610        13.33
     791.039     0.937500         4672        16.00
     842.239     0.943750         4703        17.78
     904.703     0.950000         4734        20.00
     994.303     0.956250         4765        22.86
    1054.719     0.962500         4797        26.67
    1138.687     0.968750         4828        32.00
    1218.559     0.971875         4843        35.56
    1292.287     0.975000         4860        40.00
    1384.447     0.978125         4874        45.71
    1475.583     0.981250         4890        53.33
    1672.191     0.984375         4906        64.00
    1709.055     0.985938         4913        71.11
    1771.519     0.987500         4921        80.00
    1878.015     0.989062         4929        91.43
    1986.559     0.990625         4937       106.67
    2127.871     0.992188         4945       128.00
    2367.487     0.992969         4948       142.22
    2629.631     0.993750         4952       160.00
    2981.887     0.994531         4956       182.86
    3194.879     0.995313         4960       213.33
    3364.863     0.996094         4964       256.00
    3463.167     0.996484         4966       284.44
    3567.615     0.996875         4968       320.00
    3819.519     0.997266         4970       365.71
    4018.175     0.997656         4972       426.67
    4395.007     0.998047         4974       512.00
    4636.671     0.998242         4975       568.89
    4878.335     0.998437         4976       640.00
    5148.671     0.998633         4977       731.43
    5324.799     0.998828         4978       853.33
    5529.599     0.999023         4979      1024.00
    5529.599     0.999121         4979      1137.78
    5726.207     0.999219         4980      1280.00
    5726.207     0.999316         4980      1462.86
    6041.599     0.999414         4981      1706.67
    6041.599     0.999512         4981      2048.00
    6041.599     0.999561         4981      2275.56
    6369.279     0.999609         4982      2560.00
    6369.279     0.999658         4982      2925.71
    6369.279     0.999707         4982      3413.33
    6369.279     0.999756         4982      4096.00
    6369.279     0.999780         4982      4551.11
    6615.039     0.999805         4983      5120.00
    6615.039     1.000000         4983          inf
#[Mean    =      336.398, StdDeviation   =      415.590]
#[Max     =     6610.944, Total count    =         4983]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7350 requests in 30.08s, 2.11GB read
  Socket errors: connect 0, read 0, write 0, timeout 116
Requests/sec:    244.32
Transfer/sec:     71.86MB