wrk2/dome-no-cache/300KB/wrk-eth3-rep10.log
Running 30s test @ https://bench-eth2.netdev-lab.org/300k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 737.594ms, rate sampling interval: 3565ms
  Thread calibration: mean lat.: 606.748ms, rate sampling interval: 2750ms
  Thread calibration: mean lat.: 693.139ms, rate sampling interval: 3483ms
  Thread calibration: mean lat.: 701.297ms, rate sampling interval: 2918ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.49s     2.69s   18.53s    90.39%
    Req/Sec    62.57      6.68    80.00     82.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  362.24ms
 75.000%    1.45s 
 90.000%    4.00s 
 99.000%   14.46s 
 99.900%   18.15s 
 99.990%   18.45s 
 99.999%   18.55s 
100.000%   18.55s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      50.047     0.000000            1         1.00
     168.959     0.100000          506         1.11
     205.183     0.200000         1010         1.25
     240.383     0.300000         1514         1.43
     292.351     0.400000         2021         1.67
     362.239     0.500000         2523         2.00
     493.055     0.550000         2776         2.22
     615.423     0.600000         3028         2.50
     803.327     0.650000         3282         2.86
    1060.863     0.700000         3534         3.33
    1454.079     0.750000         3785         4.00
    1731.583     0.775000         3911         4.44
    1968.127     0.800000         4037         5.00
    2265.087     0.825000         4163         5.71
    2715.647     0.850000         4290         6.67
    3244.031     0.875000         4416         8.00
    3602.431     0.887500         4480         8.89
    4003.839     0.900000         4542        10.00
    4456.447     0.912500         4605        11.43
    5115.903     0.925000         4668        13.33
    5783.551     0.937500         4731        16.00
    6148.095     0.943750         4763        17.78
    6639.615     0.950000         4794        20.00
    7139.327     0.956250         4826        22.86
    7733.247     0.962500         4857        26.67
    8552.447     0.968750         4889        32.00
   10248.191     0.971875         4905        35.56
   11223.039     0.975000         4920        40.00
   12312.575     0.978125         4936        45.71
   13656.063     0.981250         4952        53.33
   14032.895     0.984375         4969        64.00
   14123.007     0.985938         4976        71.11
   14270.463     0.987500         4983        80.00
   14360.575     0.989062         4991        91.43
   14598.143     0.990625         4999       106.67
   14966.783     0.992188         5007       128.00
   15114.239     0.992969         5011       142.22
   15319.039     0.993750         5015       160.00
   15409.151     0.994531         5019       182.86
   15482.879     0.995313         5023       213.33
   15704.063     0.996094         5027       256.00
   15753.215     0.996484         5030       284.44
   15859.711     0.996875         5031       320.00
   16236.543     0.997266         5033       365.71
   16580.607     0.997656         5035       426.67
   16973.823     0.998047         5037       512.00
   17006.591     0.998242         5038       568.89
   17858.559     0.998437         5039       640.00
   17956.863     0.998633         5040       731.43
   18153.471     0.998828         5041       853.33
   18202.623     0.999023         5042      1024.00
   18202.623     0.999121         5042      1137.78
   18268.159     0.999219         5043      1280.00
   18268.159     0.999316         5043      1462.86
   18399.231     0.999414         5044      1706.67
   18399.231     0.999512         5044      2048.00
   18399.231     0.999561         5044      2275.56
   18448.383     0.999609         5045      2560.00
   18448.383     0.999658         5045      2925.71
   18448.383     0.999707         5045      3413.33
   18448.383     0.999756         5045      4096.00
   18448.383     0.999780         5045      4551.11
   18546.687     0.999805         5046      5120.00
   18546.687     1.000000         5046          inf
#[Mean    =     1492.026, StdDeviation   =     2686.346]
#[Max     =    18530.304, Total count    =         5046]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7480 requests in 30.01s, 2.15GB read
  Socket errors: connect 0, read 0, write 0, timeout 44
Requests/sec:    249.24
Transfer/sec:     73.35MB