wrk2/dome-no-cache/300KB/wrk-wlan0-rep10.log
Running 30s test @ https://bench-eth2.netdev-lab.org/300k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 673.039ms, rate sampling interval: 3252ms
  Thread calibration: mean lat.: 397.590ms, rate sampling interval: 1412ms
  Thread calibration: mean lat.: 531.365ms, rate sampling interval: 2932ms
  Thread calibration: mean lat.: 670.236ms, rate sampling interval: 3043ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.55s     4.05s   26.69s    89.49%
    Req/Sec    53.28      6.71    68.00     78.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  181.76ms
 75.000%  304.38ms
 90.000%    7.03s 
 99.000%   18.45s 
 99.900%   21.73s 
 99.990%   26.71s 
 99.999%   26.71s 
100.000%   26.71s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.007     0.000000            1         1.00
      81.727     0.100000          416         1.11
     111.935     0.200000          833         1.25
     141.055     0.300000         1250         1.43
     161.919     0.400000         1664         1.67
     181.759     0.500000         2080         2.00
     195.199     0.550000         2287         2.22
     212.607     0.600000         2494         2.50
     235.263     0.650000         2702         2.86
     264.703     0.700000         2911         3.33
     304.383     0.750000         3117         4.00
     341.759     0.775000         3221         4.44
     385.023     0.800000         3325         5.00
     457.983     0.825000         3430         5.71
     564.735     0.850000         3533         6.67
     845.823     0.875000         3637         8.00
    1591.295     0.887500         3689         8.89
    7057.407     0.900000         3741        10.00
    8327.167     0.912500         3793        11.43
    9625.599     0.925000         3846        13.33
   11034.623     0.937500         3897        16.00
   12115.967     0.943750         3923        17.78
   12607.487     0.950000         3950        20.00
   13279.231     0.956250         3975        22.86
   14016.511     0.962500         4001        26.67
   14598.143     0.968750         4027        32.00
   14991.359     0.971875         4040        35.56
   15589.375     0.975000         4053        40.00
   16039.935     0.978125         4066        45.71
   16556.031     0.981250         4079        53.33
   17285.119     0.984375         4092        64.00
   17891.327     0.985938         4098        71.11
   18317.311     0.987500         4105        80.00
   18431.999     0.989062         4111        91.43
   18792.447     0.990625         4118       106.67
   19333.119     0.992188         4124       128.00
   19447.807     0.992969         4127       142.22
   19595.263     0.993750         4131       160.00
   19759.103     0.994531         4134       182.86
   19955.711     0.995313         4137       213.33
   20447.231     0.996094         4140       256.00
   20840.447     0.996484         4142       284.44
   20955.135     0.996875         4144       320.00
   21020.671     0.997266         4145       365.71
   21217.279     0.997656         4147       426.67
   21397.503     0.998047         4148       512.00
   21495.807     0.998242         4149       568.89
   21561.343     0.998437         4151       640.00
   21561.343     0.998633         4151       731.43
   21725.183     0.998828         4152       853.33
   21725.183     0.999023         4152      1024.00
   23855.103     0.999121         4153      1137.78
   23855.103     0.999219         4153      1280.00
   25460.735     0.999316         4154      1462.86
   25460.735     0.999414         4154      1706.67
   25460.735     0.999512         4154      2048.00
   26001.407     0.999561         4155      2275.56
   26001.407     0.999609         4155      2560.00
   26001.407     0.999658         4155      2925.71
   26001.407     0.999707         4155      3413.33
   26001.407     0.999756         4155      4096.00
   26705.919     0.999780         4156      4551.11
   26705.919     1.000000         4156          inf
#[Mean    =     1546.043, StdDeviation   =     4051.910]
#[Max     =    26689.536, Total count    =         4156]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6206 requests in 30.03s, 1.78GB read
  Socket errors: connect 0, read 0, write 0, timeout 34
Requests/sec:    206.68
Transfer/sec:     60.82MB